src/cf/Catalogs/мвв_ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>мвв_ДоговорыКонтрагентов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<Comment>(Общ) Определяет валюту взаиморасчетов по договору, не может меняться, если по договору проведен хотя бы один документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентКомиссионногоВознаграждения</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетАгентскогоНДС</Name>
					<Comment>Признак того что в данном договоре организация выступает в качестве налогового агента</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетыВУсловныхЕдиницах</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановленСрокОплаты</Name>
					<Comment>Если не установлен, для контроля просроченной задолженности используется срок из констант</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплаты</Name>
					<Comment>Срок в днях, после которого долг считается просроченным</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляСчетаФактурыНаАванс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Comment>(УСК)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.мвв_ДСП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДеятельностиПоСтрахованию</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мвв_ВидыДеятельностиПоСтрахованию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДоговорЗалога</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассПредметаЗалога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>уи_Краткосрочный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедениеВзаиморасчетов</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговыйАгентПоОплате</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Территории</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Территория</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/мвв_ДоговорыКонтрагентов/Ext/ObjectModule.bsl
// ОРТИКОН НАЧАЛО------------------------------------------------------
Перем мВыполнятьПроверки Экспорт;      //  условие
// ОРТИКОН КОНЕЦ-------------------------------------------------------

Процедура ПроверитьПередЗаписью(Отказ, Сообщать = Истина) Экспорт

	Если Не ЭтоНовый() и не ПометкаУдаления=Ссылка.ПометкаУдаления тогда
		//В случае установки или снятия пометки удаления не производить проверку
		Возврат;
	КонецЕсли;

	// Проверим, можно ли изменять реквизиты договора.
	// Проверка осуществляется только, если записывается уже существующий договор
	Если НЕ ЭтоНовый() Тогда

		Если ЭтоГруппа Тогда

			// Для группы владельца менять нельзя
			Если Владелец <> Ссылка.Владелец Тогда

				Если не Сообщать=Ложь тогда
					Сообщить("Нельзя изменять контрагента для группы договоров.", СтатусСообщения.Важное);
				КонецЕсли;
				Отказ = Истина;
			КонецЕсли; 

		Иначе

			// Проверим Заполнение обязательных реквизитов "Организация"
			Если НЕ ЗначениеЗаполнено(Организация) Тогда
				Если не Сообщать=Ложь тогда
					Сообщить("Для договора """ + Наименование + """ не указана организация.
							 |Элемент не записан.", 
							 СтатусСообщения.Важное);
				КонецЕсли;
				Отказ = Истина;
			КонецЕсли;

			// Проверим возможность смены владельца для договора
			Если Владелец <> Ссылка.Владелец Тогда

				Если КритерииОтбора.ДокументыПоДоговоруКонтрагента.Найти(Ссылка).Количество() > 0 Тогда

					Если не Сообщать=Ложь тогда
						Сообщить("Существуют документы, оформленные по договору """ + Наименование + """.
							 |Контрагент договора не может быть изменен, элемент не записан.", 
							 СтатусСообщения.Важное);
					КонецЕсли;
					Отказ = Истина;

				КонецЕсли;

			КонецЕсли;

			// Проверим возможность изменения реквизитов договора
			Если ВалютаВзаиморасчетов <> Ссылка.ВалютаВзаиморасчетов 
			 ИЛИ ВидДоговора <> Ссылка.ВидДоговора
			 ИЛИ Организация <> Ссылка.Организация
			 ИЛИ РасчетыВУсловныхЕдиницах <> Ссылка.РасчетыВУсловныхЕдиницах Тогда
			    МассивДокументов = КритерииОтбора.ДокументыПоДоговоруКонтрагента.Найти(Ссылка);
			    ЕстьПроведенныеДокументы = Ложь;

				Для каждого Документ из МассивДокументов Цикл

					ЕстьПроведенныеДокументы = Документ.Проведен;

					Если ЕстьПроведенныеДокументы тогда
						Прервать;
					КонецЕсли;

				КонецЦикла;

				Если ЕстьПроведенныеДокументы Тогда
                    Если не Сообщать=Ложь тогда
						Сообщить("Существуют документы, проведенные по договору """ + Наименование + """.
								 |Реквизиты ""Организация"", ""Валюта взаиморасчетов"", ""Вид договора"", ""Расчеты в условных единицах"" не могут быть изменены.
								 |Элемент не записан.", 
								 СтатусСообщения.Важное);
					КонецЕслИ;
					Отказ = Истина;

				КонецЕсли;

			КонецЕсли;

		КонецЕсли; // Если ЭтоГруппа Тогда

	КонецЕсли; // Если НЕ ЭтоНовый() Тогда

	// Проверим заполнение обязательных реквизитов.
	Если Не ЭтоГруппа Тогда

		// Проверим Заполнение обязательных реквизитов "Организация"
		Если НЕ ЗначениеЗаполнено(Организация) Тогда
			Если не Сообщать=Ложь тогда
				Сообщить("Не указана организация для договора.", СтатусСообщения.Важное);
			КонецЕслИ;	
			Отказ = Истина;
		КонецЕсли; 

		// Проверим, заполнена ли валюта
		Если НЕ ЗначениеЗаполнено(ВалютаВзаиморасчетов) Тогда
			Если не Сообщать=Ложь тогда
				Сообщить("Не указана валюта договора ", СтатусСообщения.Важное);
			КонецЕсли;
			Отказ = Истина;
		КонецЕсли;

		// Проверим, заполнен ли вид договора
		Если НЕ ЗначениеЗаполнено(ВидДоговора) Тогда
			Если не Сообщать=Ложь тогда
				Сообщить("Не указан вид договора ", СтатусСообщения.Важное);
			КонецЕсли;
			Отказ = Истина;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
 
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура вызывается перед записью элемента справочника.
//
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	
	// ОРТИКОН НАЧАЛО------------------------------------------------------
	//ПроверитьПередЗаписью(Отказ, Истина);
	Если ВидДеятельностиПоСтрахованию.Пустая() Тогда
		ВидДеятельностиПоСтрахованию = Перечисления.ус_ВидыДеятельностиПоСтрахованию.Общехозяйственный;	
	КонецЕсли; 
		
	Если мВыполнятьПроверки Тогда
        ПроверитьПередЗаписью(Отказ, Истина);
	КонецЕсли;
	// ОРТИКОН КОНЕЦ-------------------------------------------------------


КонецПроцедуры // ПередЗаписью()


// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()


// ОРТИКОН НАЧАЛО------------------------------------------------------ 

// Процедура-обработчик "ПриЗаписи"
//
// Параметры
//	Нет
//
Процедура ПриЗаписи(Отказ)
	Если ЗначениеЗаполнено(Договор) Тогда
		Если ПометкаУдаления <> Договор.ПометкаУдаления Тогда
			ДоговорОбъект = Договор.ПолучитьОбъект();
			ДоговорОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // ПриЗаписи(Отказ)
 
мВыполнятьПроверки = Истина;
// ОРТИКОН КОНЕЦ-------------------------------------------------------
